<template lang="pug">
  section.main
    .h1 Часто задаваемые вопросы
    template(v-for="item in items")
      .question(@click="toggle(item)") {{item.title}}
      transition(name="fade")
        .answer(v-show="item.opened") {{item.text}}
</template>

<script>
export default {
  data () {
    return {
      items: [{
        id: 1,
        title: 'Дегельминтизация - что это? Зачем нужна дегельминтизация?',
        text: 'Дегельминтизация - комплекс профилактических мер по очищению организма от гельминтозов (глистов). Основная цель дегельминтизации очищение кишечника от гельминтов. Очищение проводится лекарствами - антигельметиками. Профилактическая дегельминтизация становится лечебной в том случае, когда животное достаточно сильно заражено паразитами.',
        opened: false,
      }, {
        id: 2,
        title: 'Почему прививки животным так важны. Делать ли вакцинацию щенку или котенку?',
        text: 'Для защиты организма собак, кошек, а уж тем более неокрепшего организма щенка или котенка от вирусных инфекционных заболеваний им просто необходимо делать профилактические прививки. Каждый год множество животных разных возрастов серьезно заболевает и даже умирает от ряда инфекционных заболеваний, что можно предотвратить с помощью вакцинации. Большинство вакцин работают против стандартного набора наиболее распространенных и опасных заболеваний таких как: парвавирусный энтерит, аденовирусный гепатит, чума плотоядных, лептоспироз, парагриппинфлюэнция, бешенство, клещевой энцефалит. Все не привитые вакцинами животные подвергаются смертельному риску, т.к. для перечисленных выше заболеваний эффективность лечения составляет около 50-60%. Правила вакцинации животных. К вакцинации допускаются только клинически здоровые (без признаков заболевания), не ослабленные собаки и кошки, свободные от экто- и эндопаразитов. Перед прививкой проводят профилактическую дегельминтизацию (избавление от гельминтов). Чтобы быть уверенным, что животное избавлено от гельминтов, ангельминтик дают двукратно, с интервалом 10-14 дней. В случае наличия эктопаразитов (блох, вшей, клещей и пр.) животное должно быть обработано соответствующими инсекто-акарицидами до проведения дегельминтизации. Спустя 10-14 дней после проведения дегельминтизации можно проводить вакцинацию. В соответствии с законодательством РФ рекомендуется оформить в ветеринарной клинике паспорт на собаку или кошку, который предназначен для учета вакцинации и других профилактических мероприятий. Это вынужденная мера, которая позволяет следить за правильной вакцинацией животных, а именно для защиты других животных от бешенства. Перед вакцинацией ветеринарным врачом проводится тщательный осмотр.',
        opened: false,
      }, {
        id: 3,
        title: 'Как правильно вакцинировать щенков?',
        text: 'Вакцинировать щенков и котят начинают в возрасте 8 недель, в некоторых случаях с 6 недель. Вакцинация проводится 2-х или 3-х кратно в соответствии с применяемой вакциной. Схему и кратность вакцинации определяет врач. Вакцинацию против бешенства можно проводить с 3 месяцев. Вакцинировать можно только здоровых животных. Напряженный иммунитет развивается через 2 недели после 2-ой (3-ей) вакцинации. В этот период не рекомендуются повышенные физические нагрузки или выполнение операции. До завершения вакцинации щенки или котята должны находится на карантине.',
        opened: false,
      }],
    }
  },
  methods: {
    toggle (item) {
      item.opened = !item.opened
    },
  },
  head () {
    return {
      title: 'Часто задаваемые вопросы',
    }
  },
}
</script>

<style scoped>
.question {
  cursor: pointer;
  color: #2078bb;
  display: block;
  margin-bottom: 15px;
  padding-bottom: 15px;
  border-bottom: 1px dotted #ccc;
  &:hover {
    color: #bd2026;
  }
}
.answer {
  margin: 0 0 25px 20px;
  line-height: 1.5;
}
</style>
